---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupPropagationFailedSketch
source: html/f3fdb2f7-d992-0e56-5618-470163812c7c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.GroupPropagationFailedSketch Property

Can't change Group"[Name]" with more than one instance because it has a Sketch-based element. Edit the Sketch of the element instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId GroupPropagationFailedSketch { get; }
```